{
"Welcome to the fault drill": "欢迎体验故障演练",
"Drill scenarios":	"演练场景",
"Host":	"主机",
"Please input":	"请输入",
"Select a scene to directly create a drill":	"选中场景可以由此直接创建演练啦",
"Search results":"搜索结果",
"create drill":	"创建演练",
"System resources":	"系统资源",
"CPU resources":	"CPU资源",
"When the CPU is full, you can check whether the CPU utilization reaches the specified value through the top command.":	"cpu满载可以通过top命令查看到CPU的利用率是否达到指定值。",
"RAM resources":	"内存资源",
"Occupies the specified percentage of system memory. If the current percentage of system memory is less than the target percentage, it will be occupied until the specified percentage.":	"占用指定百分比的系统内存，如果当前系统内存百分比占用少于目标百分比，则会占用直到指定百分比。",
"Disk resources":	"磁盘资源",
"Increasing the load of hard disk can examine the performance of application services when the performance of hard disk is insufficient.":	"提高硬盘负载，可考察硬盘性能不足时应用服务的表现。",
"Fill in the specified hard disk directory to simulate the performance of application services when the remaining space of the hard disk is insufficient.":	"填充指定硬盘目录，模拟硬盘剩余空间不足时，应用服务的表现。",
"File permission modification simulates the modification of file permission.":	"文件权限修改，模拟文件权限的修改。",
"When the simulation file is deleted, the fault-tolerant strategy of reading the file can be applied after the simulation file is deleted.":	"模拟文件被删除场景，可以模拟文件被删除后，应用读取文件的容错策略。",
"File movement, simulation of file loss, storage location error and other scenarios.":	"文件移动，模拟文件丢失，存放位置错误等场景。",
"Support directory creation, file creation, file creation, initialization content, and automatic creation of nonexistent file paths.":	"支持目录创建，文件创建，文件创建初始化内容，自动创建不存在的文件路径。",
"File content addition can simulate exception log injection, and apply fault-tolerant strategies for reading file content exceptions.":	"文件内容追加，可以模拟异常日志注入，应用读取文件内容异常的容错策略等。",
"There are {20} in total":	"共有{20}条",	
"network resource":	"网络资源",
"Simulate the scenario of network packet loss when the network environment is unstable. If the packet loss rate is set to 100%, the scenario of 'network impassability' can be simulated.":	"模拟在网络环境不稳定的情况下，网络包丢失的场景，如果设置丢包率为100%，则可以模拟“网络不通”的场景。",
"The network packet is out of order, which simulates the instability of the network. It is a scenario in which the request order is out of order.":	"网络包乱序，模拟网络情况不稳定是，请求顺序错乱情况下的场景。",
"Simulate the scenario where the specified port is occupied.":	"模拟指定端口被占用的场景。",
"Simulate the scenario where DNS is tampered with or DNS is configured incorrectly.":	"模拟dns被篡改，或dns配置错误场景。",
"Simulate the repetition of network packets, which can simulate the scenario of repeated requests.":	"模拟网络包的重复，可模拟重复请求场景。",
"Simulate the scenario of poor network environment and request delay, and further simulate the delay of accessing external resources.":	"模拟网络环境较差，请求出现延迟的等场景，可进一步模拟访问外部资源延迟等。",
"Application process":	"应用进程",
"Specifies that the process is suspended to simulate the impact on its own service after the process is suspended.":	"指定进程挂起，模拟进程挂起后对自身服务的影响。",
"Container resources":	"容器资源",
"Container contents removal":	"容器内容器移除",
"Java in process":	"JAVA进程内",
"Throwing anomaly":	"抛异常",
"Custom fault":	"自定义故障",
"Tampering with data":	"篡改数据",
"Resource occupation":	"资源占用",
"Kill the specified process and simulate the scene after the process is stopped directly. This scene cannot be recovered. Please use it with caution!!!.":	"杀掉指定进程，模拟进程直接停宕后的场景，该场景不可恢复，请慎用！！！。",
"Simulate the {servlet} delay scenario.":	"模拟{servlet}延迟的场景。",
"Simulate the scenario where {PSQL} throws a custom exception.":	"模拟{psql}抛出自定义异常的场景。",
"Custom JVM scripts can flexibly simulate various JVM scenarios: logs, exceptions, parameter tampering, etc.":	"自定义jvm脚本，可灵活模拟各种jvm场景：日志、异常、参数篡改等。",
"Modify the value of the update field or insert field of SQL to simulate asset loss and other scenarios.":	"修改sql的更新字段的值或者插入字段的值，可模拟资损等场景。",
"Modify the return value of the JVM to simulate the scenario of abnormal return content in the interface.":"修改jvm的返回值，模拟接口内返回内容异常的场景。",
"Tamper with the return value of HSF interface and simulate the abnormal scene returned by the interface.":	"篡改hsf接口的返回值，模拟接口返回异常场景。",
"Codecache is mainly used to store native code, mainly JIT compiled code. The code compiled by JIT is generally ''hot code'', that is, the code with high call frequency. After JIT compilation, the execution efficiency of the code will become higher. If the codecache is full, the JVM will close JIT compilation and cannot be opened again. Then the full codecache will reduce the system operation efficiency and reduce the maximum load of the system. When the system traffic is large, it can be manifested as increased RT and decreased QPS.":	"CodeCache主要用于存放native code，其中主要是JIT编译后的代码。被JIT编译的一般都是“热代码”，简单说就是调用频率比较高的代码，JIT编译后，代码的执行效率会变高，CodeCache满会导致JVM关闭JIT编译且不可再开启，那么CodeCache满会引起系统运行效率降低，导致系统最大负载下降，当系统流量较大时，可表现为RT增高、QPS下降等。",
"The JVM does not have enough memory to allocate and cannot reclaim memory after trying GC, so it throws an oom.":	"jvm没有足够的内存来进行分配，并且尝试gc之后无法回收内存，所以就会抛出OOM。",
"drill experience library":	"演练经验库",
"please enter experience name":	"请输入经验库名称",
"please select application type":	"请选择应用类型",
"experience library  management":	"经验库管理",
"Create drill":	"创建演练",
"Drill experience details page":	"演练经验库详情页",
"Experience name":	"经验名称",
"Experience description":	"经验描述",
"background":	"背景",
"Architectural Weaknesses":	"架构弱点",
"Other Information":	"其它信息",
	
"Create from blank":	"从空白创建",
"Not matched to experience base":	"未匹配到经验库",
"Current experience supports {} application types":	"当前经验支持{}应用类型",
"Operating environment":	"运行环境",
"evaluating":	"评测",
"Process configuration":	"流程配置",
"Rules":	"规则",
"close":	"关闭",
"The current node will wait for the specified time before running":	"当前节点运行前会等待指定时间",
"Wait before execution (MS)":	"执行前等待(毫秒)",
"Wait for the specified time after the current node is running. If it is in the process of ending the drill, it will not take effect":	"当前节点运行完毕后等待指定时间,如果处于演练终止中,则不生效",
"Wait after execution (MS)":	"执行后等待(毫秒)",
"Whether to proceed to the next node after the current node runs (whether successful or failed)":	"当前节点运行完毕之后(无论成功失败)是否进行下一个节点",
"Whether to promote the drill manually":	"是否手工推进演练",
"yes":	"是",
"no":	"否",
"Failure tolerance: when the failure ratio of the following machines or subtasks exceeds the specified value, the current node will be recognized as failure, and the value is [0-100]":	"失败容忍度,当下面的机器或者子任务运行失败占比超过指定值,当前节点才会认定为失败,值在[0-100]",
"Failure tolerance":	"失败容忍度",
"Whether to terminate the drill immediately after the current node fails will only take effect if it is not pushed manually":	"当前节点失败后是否立刻终止演练,只在非手动推进才生效",
"Do you want to terminate the drill now":	"是否立刻终止演练",
"Group":	"分组",
"Application Management":	"应用管理",
"No related applications found":	"没有发现相关应用",
"Please re-enter keywords to search, or choose to access this app.":	"请重新输入关键词进行搜索，或选择接入此应用。",
"Access Guide":	"接入指南",
"No application currently":	"当前暂无应用",
"It is recommended that you":	"建议您在使用前",
"click here":	"点击这里",
"View the app access guide and click here":	"查看应用接入指南，然后在此",
"View connected apps.":	"查看已接入应用。",
"New application access":	"新应用接入",
"No machine free applications are shown":	"不展示无机器应用",
"Show no machine applications":	"展示无机器应用",
"Application Overview":	"应用概览",
"Basic information":	"基础信息",
"Application name":	"应用名称",
"Application type":	"应用类型",
"Last drill time":	"最近一次演练时间",
"Results of the last drill":	"最近一次演练结果",
"Machine grouping":	"机器分组",
"Machine ":	"机器",
"Group all":	"全部分组",
"Pod name":	"pod名",
"Host name":	"主机名",
"Public":	"公",
"Private":	"私",
"On-line":	"在线",
"Not installed":	"未安装",
"Off-line":	"离线",
"Edit label":	"编辑标签",
"Operation successful":	"操作成功",
"Please enter group name":	"请输入分组名称",
"Cluster":	"集群",
"Version":	"版本",
"start time":	"启动时间",
"Status":	"状态",
"Batch labeling":	"批量添加标签",
"Label":	"标签",
"Please enter the full label and press enter":	"请输入完整标签并按下回车键",
"Please add up to 5 labels with no more than 30 characters. If you need to modify the label, please delete the label and add it again.":	"最多可添加5个标签，标签不超过30个字符，如需修改标签请删除该标签后重新添加。",
"Application management, please select application language":	"请选择应用语言",
"Specify the application and application group by configuring the JVM startup parameters, which is used to accurately divide the application / application group to which the machine belongs (it does not conflict with the application / application group specified when installing the probe). The configuration steps are as follows:":	"通过配置 JVM 启动参数来指定应用和应用分组，用于精确划分该机器所归属的应用/应用分组（与安装探针时指定的应用/应用分组不冲突）。配置步骤如下：",
"Please select application deployment method":	"请选择应用部署方式",
"Identify the application / application group to which it belongs through the pod tag. The configuration is as follows:":	"通过 Pod 标签识别其所归属的应用/应用分组，配置如下：",
"In the cluster where the fault drill probe has been deployed, modifying the pod tag can take effect without redeploying the fault drill probe.":	"在已部署故障演练探针的集群，修改 Pod 标签即可生效，无需重新部署故障演练探针。",
"High":	"高",
"Low":	"低",
"Normal":	"普通",
"Yes":	"是",
"No":	"否",
"The configuration is invalid and cannot be edited":	"配置失效无法编辑",
"Modify":	"修改",
"Name":	"名称",
"Description":	"描述",
"Configure priority":	"配置优先级",
"Applicable grouping":	"适用分组",
"Configuration value":	"配置值",
"Overwrite user configuration":	"是否覆盖用户配置内容",
"Modification time":	"修改时间",
"Operation":	"操作",
"Success":	"成功",
"Not as expected":	"不符合预期",
"Abnormal":	"异常",
"Interrupt":	"中断",
"In execution":	"执行中",
"View details":	"查看详情",
"Drill name":	"演练名",
"Start time":	"开始时间",
"End time":	"结束时间",
"Please select the deployment type as host":	"请选择部署类型为主机的类型",
"Please select a deployment type of kubernetes":	"请选择部署类型为Kubernetes的类型",
"Please select a drill application":	"请选择演练应用",
"Can't find app":	"找不到应用",
"Application Notes":	"应用说明",
"Application types are divided into host and kubernetes":	"应用类型分为:主机和Kubernetes",
"The two types correspond to ECS installation and kubernetes installation respectively.":	"两种类型分别对应Ecs安装和Kubernetes安装两种方式。",
"Different application types have different drill scenarios to choose from.":	"不同的应用类型,可选择的演练场景也会有差异。",
"If no application can be queried, you can view it in the following ways":	"如果查询不到应用,您可按以下方式查看",
"Application access":	"应用接入",
"Application management":	"应用管理",
"Machine selection":	"机器选择",
"Specify IP selection":	"指定IP选择",
"Percentage selection":	"百分比选择",
"[note] re select the number of machines according to the percentage before each drill.":	"【注意】每次演练开始前按照百分比重新选择机器数量。",
   "Welcome to the fault drill": "欢迎体验故障演练",
   "When entering for the first time, you need to install the drill probe first": "首次进入，需先安装演练探针",
   "Chaos supports multi-platform installation": "Chaos支持多平台安装",
   "Install the walkthrough probe": "安装演练探针",
   "Choose a walkthrough scenario to quickly create a walkthrough": "选择演练场景，快速创建一个演练",
   "Provide multi-component, multi-source scenarios": "提供多组件，多来源的场景",
   "Choose a rehearsal scene": "选择演练场景",
   "Want to learn more?": "希望了解更多信息？",
   "Directly view the help documents and tutorials we provide": "直接查看我们提供的帮助文档及教程",
   "View documentation": "查看文档",
   "Put away": "收起",
   "Drill": "演练",
   "Total number of drills": "总演练数",
   "Number of drills performed": "执行演练数",
   "Running": "运行中",
   "Success": "成功",
   "Fail": "失败",
   "Number of drills not performed": "未执行演练数",
   "Probe": "探针",
   "Host probe": "主机探针",
   "Number of online": "在线数目",
   "Normal number": "正常数目",
   "Number of exceptions": "异常数目",
   "Cluster probe": "集群探针",
   "Exercise log": "演练日志",
   "Recent drills": "最近演练",
   "Scheduled tasks to be executed": "待执行定时任务",
   "Number of drills": "演练次数",
   "Common practice scenarios": "常用演练场景",
   "System resources/CPU resources": "系统资源/CPU资源",
   "The CPU in the host is fully loaded": "主机内Cpu满载",
   "View all": "查看全部",
   "Create drill": "创建演练",
   "Component type": "组件类型",
   "Operating system": "操作系统",
   "Application": "应用",
   "Container service": "容器服务",
   "Advanced scene": "进阶场景",
   "Drill experience": "演练经验",
   "A set of exercise templates for a failure effect or system component": "针对某个故障效果或者系统组件的一套演练模板",
   "See details": "查看详情",
   "Change batch": "换一批",
   "Notification": "消息通知",
   "Best Practices": "最佳实践"
}
